biddr_api/app/models/bid.rb

SELECT MAX("bids"."price") FROM "bids" WHERE "bids"."auction_id" = $1  [["auction_id", 5]]
---
  def max_bid
    auction.bids.maximum('price')