biddr_api/app/controllers/api/v1/auctions_controller.rb

SELECT  "users".* FROM "users" ORDER BY "users"."id" DESC LIMIT $1  [["LIMIT", 1]]
INSERT INTO "auctions" ("title", "details", "ends_on", "reserve_price", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    auction = Auction.new auction_params
    auction.user = User.last # current_user

    auction.save

DELETE FROM "auctions" WHERE "auctions"."id" = $1  [["id", 11]]
---
  def destroy
    auction.destroy

SELECT  "auctions".* FROM "auctions" WHERE "auctions"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]
---
  def auction
    Auction.find params[:id]