biddr_api/app/controllers/api/v1/bids_controller.rb

  def create
    auction = Auction.find params[:auction_id]
    bid = Bid.new bid_params

    bid.auction = auction
    bid.user = User.last # current_user

    bid.save
---
SELECT  "auctions".* FROM "auctions" WHERE "auctions"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]
SELECT  "users".* FROM "users" ORDER BY "users"."id" DESC LIMIT $1  [["LIMIT", 1]]
INSERT INTO "bids" ("price", "created_at", "updated_at", "user_id", "auction_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["price", 250], ["created_at", "2018-11-27 23:58:54.560276"], ["updated_at", "2018-11-27 23:58:54.560276"], ["user_id", 16], ["auction_id", 11]]