biddr_api/app/controllers/api/v1/bids_controller.rb

SELECT  "auctions".* FROM "auctions" WHERE "auctions"."id" = $1 LIMIT $2  [["id", 13], ["LIMIT", 1]]
---
  def auction
    Auction.find params[:auction_id]